TabbycatPie/CustomKeyboard/CH551CustomKeyboard/usar/CompositeKM.C
#include "CH552.H"                                                      
#include "Debug.H"
#include <string.h>
#include "pn297_L.h"
//#include <stdio.h>

//#define Fullspeed
#define THIS_ENDP0_SIZE         DEFAULT_ENDP0_SIZE

UINT8X  Ep0Buffer[8>(THIS_ENDP0_SIZE+2)?8:(THIS_ENDP0_SIZE+2)] _at_ 0x0000;    //端点0 OUT&IN缓冲区，必须是偶地址
UINT8X  Ep1Buffer[64>(MAX_PACKET_SIZE+2)?64:(MAX_PACKET_SIZE+2)] _at_ 0x000a;  //端点1 IN缓冲区,必须是偶地址
//UINT8X  Ep2Buffer[64>(MAX_PACKET_SIZE+2)?64:(MAX_PACKET_SIZE+2)] _at_ 0x0050;  //端点2 IN缓冲区,必须是偶地址
UINT8   SetupReq,SetupLen,Ready,Count,FLAG,UsbConfig;
PUINT8  pDescr;                                                                //USB配置标志
USB_SETUP_REQ   SetupReqBuf;                                                   //暂存Setup包


#define UsbSetupBuf     ((PUSB_SETUP_REQ)Ep0Buffer)
#define DEBUG 0

#pragma  NOAREGS
/*设备描述符*/
UINT8C DevDesc[18] = {
	0x12,
	0x01,	/* 设备描述符 */
	
	0x10,	/*bcdUSB 2.0*/
	0x01,
	
	0x00,
	0x00,
	0x00,
	THIS_ENDP0_SIZE,
	0x3d,	/* VID idVendor (0x0483)*/
	0x40,
	
	0x07,	/* PID idProduct = 0x5710*/
	0x20,
	
	0x00,	/*bcdDevice rel. 2.00*/
	0x01,
	
	0x01,
	0x02,
	0x03,
	0x01
};

UINT8C CfgDesc[34] =
{
//    0x09,0x02,0x3b,0x00,0x02,0x01,0x00,0xA0,0x32,             //配置描述符
//    0x09,0x04,0x00,0x00,0x01,0x03,0x01,0x01,0x00,             //接口描述符,键盘
//    0x09,0x21,0x11,0x01,0x00,0x01,0x22,0x3e,0x00,             //HID类描述符
//    0x07,0x05,0x81,0x03,0x08,0x00,0x0a,                       //端点描述符
//    0x09,0x04,0x01,0x00,0x01,0x03,0x01,0x02,0x00,             //接口描述符,鼠标
//    0x09,0x21,0x10,0x01,0x00,0x01,0x22,0x34,0x00,             //HID类描述符
//    0x07,0x05,0x82,0x03,0x04,0x00,0x0a                        //端点描述符
//////////////////////////////////////////////////
/***************** 配置描述符 *******************/
	0x09,	/* bLength: 长度，设备字符串的长度为9字节 */
	0x02,	/* 类型，表明配置描述符类型 */
	0x3b,	//配置描述符总长度
	0x00,
	0x01,	/* 接口数量  接口和端点是不用的*/
	0x01,	/*bConfigurationValue: Configuration value*/
	0x00,	/* 该配置的字符串的索引值，该值为0表示没有字符串 */
	0xA0,	/*bmAttributes: Self powered */
	0x32,	/* 从总线上获得电源大小，最大配置100ma */
	
//////////////////////////////////////////////////
/************** 键盘接口的描述符 ****************/
	0x09,	/* 接口描述符的长度为9字节 */
	0x04,	/* 表面接口描述符 */
	0x00,	/* 该接口编号 */
	0x00,	/* 该接口得备用编号 */
	0x01,	/* 该接口所使用端点数量 */
	0x03,	/* 该接口所使用的类   键盘属于HID */
	0x01,	/* 该接口所用的子类 1=BOOT, 0=no boot */
	0x01,	/* 键盘是1   鼠标是2  0是自定义设备 */
	0x00,   /* 该接口字符串的索引  一般都为0 */

//////////////////////////////////////////////////
/************** 键盘HID的描述符 *****************/
	0x09,	/* bLength: 长度，HID描述符的长度为9字节 */
	0x21,	/* HID的描述符类型 */
	0x11,	/* HID协议的版本 */
	0x01,
	0x00,	/* 国家代号 */
	0x01,	/* 下级描述符的数量 */
	0x22,	/* 下级描述符的类型 */
	0x3e,	/* 下一级描述符的长度 */
	0x00,

/////////////////////////////////////////////////////////////////
/************** 键盘输入端口描述符(端点描述符) *****************/
	0x07,	/* 端点描述符的长度为7字节 */
	0x05,	/* 端点描述符的类型 */
	0x81,	/* 该端点(输入)的地址,D7:0(OUT),1(IN),D6~D4:保留,D3~D0:端点号 */
	0x03,	/* 端点的属性为为中断端点. D0~D1表示传输类型:0(控制传输),
			 1(等时传输),2(批量传输),3(中断传输) 非等时传输端点:D2~D7:保留为0 等时传输端点： 
			 D2~D3表示同步的类型:0(无同步),1(异步),2(适配),3(同步) D4~D5表示用途:0(数据端点),
			 1(反馈端点),2(暗含反馈的数据端点),3(保留)，D6~D7:保留 */
	0x08,	/* 该端点支持的最大包长度 */
	0x00,
	0x06,	/* 轮询间隔 bInterval: Polling Interval (6 ms)*/

//////////////////////////////////////////////////
/************** 鼠标接口的描述符 ****************/
//	0x09,	/* 接口描述符的长度为9字节 */
//	0x04,	/* 表面接口描述符 */
//	0x01,	/* 该接口编号 */
//	0x00,	/* 该接口得备用编号 */
//	0x01,	/* 该接口所使用端点数量 */
//	0x03,	/* 该接口所使用的类   鼠标属于HID */
//	0x01,	/* 该接口所用的子类 1=BOOT, 0=no boot */
//	0x02,	/* 键盘是1   鼠标是2  0是自定义设备 */
//	0x00,   /* 该接口字符串的索引  一般都为0 */

///////////////////////////////////////////////
/************** 鼠标HID描述符 ****************/
//	0x09,	/* bLength: 长度，HID描述符的长度为9字节 */
//	0x21,	/* HID的描述符类型 */
//	0x10,	/* HID协议的版本 */
//	0x01,
//	0x00,	/* 国家代号 */
//	0x01,	/* 下级描述符的数量 */
//	0x22,	/* 下级描述符的类型 */
//	0x36,	/* 下一集描述符的长度 */ //0x34  0x36
//	0x00,

/////////////////////////////////////////////////////////////////
/************** 鼠标输入端口描述符(端点描述符) *****************/
//	0x07,	/* 端点描述符的长度为7字节 */
//	0x05,	/* 端点描述符的类型 */
//	0x82,	/* 该端点(输入)的地址,D7:0(OUT),1(IN),D6~D4:保留,D3~D0:端点号 */
//	0x03,	/*端点的属性为为中断端点. D0~D1表示传输类型:0(控制传输),
//			 1(等时传输),2(批量传输),3(中断传输) 非等时传输端点:D2~D7:保留为0 等时传输端点： 
//			 D2~D3表示同步的类型:0(无同步),1(异步),2(适配),3(同步) D4~D5表示用途:0(数据端点),
//			 1(反馈端点),2(暗含反馈的数据端点),3(保留)，D6~D7:保留*/
//	0x07,	/* 该端点支持的最大包长度 */
//	0x00,
//	0x0a    /* 轮询间隔 bInterval: Polling Interval (32 ms)*/	
	
};
/*字符串描述符*/
/*HID类报表描述符*/
UINT8C KeyRepDesc[62] =
{
	0x05,0x01,	// USAGE_PAGE (Generic Desktop)	//62
	0x09,0x06,	// USAGE (Keyboard)
	0xA1,0x01,	// COLLECTION (Application)

	0x05,0x07,	//   USAGE_PAGE (Keyboard)
	0x19,0xe0,	//   USAGE_MINIMUM (Keyboard LeftControl)
	0x29,0xe7,	//   USAGE_MAXIMUM (Keyboard Right GUI)
	0x15,0x00,	//   LOGICAL_MINIMUM (0)
	0x25,0x01,	//   LOGICAL_MAXIMUM (1)
	0x75,0x01,	//   REPORT_SIZE (1)
	0x95,0x08,	//   REPORT_COUNT (8)
	0x81,0x02,	//   INPUT (Data,Var,Abs)

	0x95,0x01,	//   REPORT_COUNT (1)
	0x75,0x08,	//   REPORT_SIZE (8)
	//
	0x81,0x01,	//   INPUT (Cnst,Var,Abs)
	0x95,0x03,	//   REPORT_COUNT (3)

	0x75,0x01,	//   REPORT_SIZE (1)
	0x05,0x08,	//   USAGE_PAGE (LEDs)
	0x19,0x01,	//   USAGE_MINIMUM (Num Lock)
	0x29,0x03,	//   USAGE_MAXIMUM (Kana)
	0x91,0x02,	//   Output (Data,Var,Abs,NWrp,Lin,Pref,NNul,NVol,Bit)
	0x95,0x05,	//   REPORT_COUNT (1)
	0x75,0x01,	//   REPORT_SIZE (3)
	0x91,0x01,	//   Output (Cnst,Ary,Abs,NWrp,Lin,Pref,NNul,NVol,Bit)
	0x95,0x06,	//   REPORT_COUNT (6)
	0x75,0x08,	//   REPORT_SIZE (8)
	0x26,0xff,0x00,		//Logical Maximum (255)
	0x05,0x07,	//   USAGE_PAGE (Keyboard/Keypad)
	0x19,0x00,	//   USAGE_MINIMUM (Undefined)
	0x29,0x91,	//   USAGE_MAXIMUM (Keyboard LANG2)
	0x81,0x00,	//   INPUT (Data,Ary,Abs)
	0xC0		//	 End Collection
};
//UINT8C MouseRepDesc[52] =
//{
//    0x05,0x01,0x09,0x02,0xA1,0x01,0x09,0x01,
//    0xA1,0x00,0x05,0x09,0x19,0x01,0x29,0x03,
//    0x15,0x00,0x25,0x01,0x75,0x01,0x95,0x03,
//    0x81,0x02,0x75,0x05,0x95,0x01,0x81,0x01,
//    0x05,0x01,0x09,0x30,0x09,0x31,0x09,0x38,
//    0x15,0x81,0x25,0x7f,0x75,0x08,0x95,0x03,
//    0x81,0x06,0xC0,0xC0
//};
/*鼠标数据*/
//UINT8 HIDMouse[4] = {0x0,0x0,0x0,0x0};
/*键盘数据*/
UINT8 HIDKey[8] = {0x0,0x0,0x0,0x0,0x0,0x0,0x0,0x0};

